Revit 2026 API

# WorksetIsEditable Property

---

Whether the workset is editable.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsEditable { get; }
```
```vb
Public ReadOnly Property IsEditable As Boolean
	Get
```
```cpp
public:
property bool IsEditable {
	bool get ();
}
```
```fsharp
member IsEditable : bool with get
```

#### Property Value

Boolean

The workset is editable if owned by current user.

#### Reference

Workset Class

Autodesk.Revit.DB Namespace